/*
Задано текст ASCII (текстовий рядок), який складається з 64 букв.
Написати функції шифрування та розшифрування заданого тексту.
Кожна при шифруванні буква тексту буде записана у елемент,
який складається з двох байтів та має структуру:
  -  у бітах 0-3 старша частина, тобто біти 4-7 ASCII - коду букви (4 біти) - СЧКБ,
  -  у бітах 4-10 позиція букви у рядку (7 біти) - ПБР,
  -  у бітах 12-15 молодша частина, тобто біти 0-3 ASCII - коду букви (4 біти) - МЧКБ,
  -  11 біт – біт парності отриманого запису (1 біт)  -БП.
  -    15 14 13 12  11  10 09 08 07 06 05 04 03 02 01 00
	   | МЧКБ    | |БП| |     ПБР          | |   СЧКБ  |
*/

/* Задано текст, який складається з 16 рядків до 4 символів у рядку. Доповнити пробілами рядки
до 16 символів. Шифрувати тексти таким чином, щоб кожний символ тексту записувався у два
байти. Два байти мають таку структуру:
у бітах 0-3 знаходиться номер рядка символу (4 біти),
у бітах 4-7 молодша частина ASCII - коду символу (4 біти),
8 біт – біт парності перших двох полів (1 біт)
у бітах 9-12 старша частина ASCII - коду символу (4 біти),
у бітах 13-14 позиція символу в рядку (2 біти),
15 біт - біт парності попередніх двох полів (1 біт). */

#include <iostream>
#include <fstream>
#include <cstring>
#include <iomanip>

using namespace std;

struct TextCode {
    unsigned short schkb : 4;   // молодша частина ASCII
    unsigned short posrow : 4;  // номер рядка
    unsigned short bitp : 1;     // біт парності
    unsigned short mchkb : 4;    // старша частина ASCII
    unsigned short poscol : 4;   // позиція символу в рядку
};